Dlubal.RFEM5.CalculationSettings
Calculation settings

Dlubal.RFEM5.CalculationSettings.MaxIterations
Maximum number of iterations

Dlubal.RFEM5.CalculationSettings.LoadCaseIncrements
Number of load case increments

Dlubal.RFEM5.CalculationSettings.LoadCombinationIncrements
Number of load combination increments

Dlubal.RFEM5.CalculationSettings.MaximumIncreasingLoading
Maximum number for increasing loading

Dlubal.RFEM5.CalculationSettings.MemberDivisionsForResultDiagram
Number of divisions of members for result diagram

Dlubal.RFEM5.CalculationSettings.SpecialMemberDivisions
Number of divisions of members for special types of members (cable, elastic foundation, taper, nonlinearity)

Dlubal.RFEM5.CalculationSettings.MemberDivisionsForMaxMin
Number of divisions of members for determination of max/min values

Dlubal.RFEM5.CalculationSettings.FeMeshSubdivisions
Subdivisions of FE mesh for graphic results

Dlubal.RFEM5.CalculationSettings.NewtonRaphsonPickard
Percentage of iterations of Newton-Raphson method in combination with Picard

Dlubal.RFEM5.CalculationSettings.DivisionForMembersWithNodes
Use division for members with nodes lying on them